// Вычислить значение формулы (a*b)/(c+d). Результат вывести

int a = 1;
int b = 2;
int c = 5;
int d = 1;

double formula = (double)(a*b)/(c+d);

// перед формулой необходимо задать тип данных!

Console.WriteLine(formula);
